cfd_backend_jobs/CFD-031EAAA5FE/extracted/CFD-DE1E23C1BE/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| Jewlz FluidForce Simulator - Generated OpenFOAM Dictionary                  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// ************************************************************************* //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 573.0081482279583;

boundaryField
{
    xMax
    {
        type fixedValue;
        value uniform 573.0081482279583;
    }

    xMin
    {
        type zeroGradient;
    }

    yMin
    {
        type zeroGradient;
    }
    yMax
    {
        type zeroGradient;
    }
    zMin
    {
        type zeroGradient;
    }
    zMax
    {
        type zeroGradient;
    }

    object
    {
        type epsilonWallFunction;
        value uniform 573.0081482279583;
    }
}
